// 자바스크립트 코드는 브라우저 내장 자바스크립트 엔진을 이용하여 실행
// 크롬 - v8 자바스크립트 엔진

// Node.js는 브라우저 내부가 아니더라도 어디서라도 엔진을 사용할 수 있다.
// 자바스크립트의 실행환경(javascript's runtime)

// 독립적으로 실행 될 수 있다는 것은 javascript로 web server 개발이 가능한 것이다.

// node.js로 만들 수 있다는 web server는 url이라는 주소로 요청을 받아서
// 요청받은 주소에 알맞는 웹사이트인데 html css javascript 로 이루어진 웹 파일들을 브라우저에 던져준다.
// 이때 url 주소는 알고보면 web server의 주소다.

//리액트는 브라우저에서 동작하는 복잡하고 여러가지 기능을 가진 javascript 파일들을 쉽게 만들어내는 기술.
//리액트를 사용해서 만들어낸 javascript파일들은 매우 여러가지의 복잡하지만 좋은 기능들을 가지고 있기 때문에 웹 브라우저에 전달되어서 고전적인 웹사이트가 아닌 마치 프로그램처럼 돌아간다.
//리액트로 만든 웹사이트 - 웹 어플리케이션
//리액트는 node.js를 기반으로 사용할 수 있는 기술이기 때문에 node.js 없이는 사용하기 어렵다.
