//shotgun surgery - 중복 코드 작성 - 유지보수에 문제가 생긴다.

//기존의 방식 - 공통된 부분이 있더라도 각 페이지마다 복사하여 코드가 길어지는 불편함이 있다.
//컴포넌트들을 각각 필요한 페이지마다 그 컴포넌트의 이름을 불러다 쓰는 방식.
//재사용되어야 하는 공통된 것들을 컴포넌트로 만드는 방식-컴포넌트화 방식.

//header에 문제가 생겼다고 했을때 기존의 방식에서는 헤더를 포함하고 있는 각각 페이지마다 수정해야하는 상황이 생긴다.
//하지만 컴포넌트화 방식은 컴포넌트가 정의된 파일만 수정하면 전체 수정이 된다.

//React는 Component 기반의 UI 라이브러리이기때문에 모든 html요소들을 다 컴포넌트로 만들어서 재사용한다.
//리액트(React)는 Facebook에서 개발한 사용자 인터페이스를 구축하는 데 사용하는 자바스크립트 라이브러리다.
//리액트는 가상 DOM을 사용하여 UI를 효율적으로 업데이트하고, 재사용 가능한 UI 컴포넌트의 생성을 허용한다.
//싱글 페이지 어플리케이션과 모바일 애플리케이션 개발에 일반적으로 사용된다.

//명령형 프로그래밍 - 절차를 하나하나 다 나열해야함
//1.결과를 표시할 요소를 가져온다(id = result)
//2.현재 결과값을 10진수 기준, 숫자형으로 변환해서 가져와 current라는 상수에 저장힌디.
//3.current상수에 저장된 값을 결과를 표시할 요소의 값에 plus라면 +1해서 넣고, minusfkaus -1해서 넣는다.

//선언형 프로그래밍 - 그냥 목적을 바로 말함
//1.plus를 누르면 , result값에 +1한다. minus를 눌렀다면 반대로한다.

//virtual dom - 발생하는 변화를 가상의 돔에 업데이트 시켜보고 한번에 업데이트 할 수 있는 부분들을 모아서 한번에 실제 dom에 업데이트 시킨다.
//DOM(Document Object Model)은 HTML 및 XML 문서용 프로그래밍 인터페이스다. 문서의 구조를 트리와 같은 구조로 나타내며 각 요소,
//속성 및 텍스트 조각이 트리의 노드로 나타난다. DOM을 사용하면 개발자가 문서의 콘텐츠, 구조 및 스타일을 프로그래밍 방식으로 조작하고 업데이트할 수 있다.
